app/controllers/gists_controller.rb

  def index
    @gists = Gist.paginate(:page => params[:page])
---
SELECT "gists".* FROM "gists" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "gists"

  def search
    @gists = Gist.search(params[:lang])
---
SELECT "gists".* FROM "gists" WHERE (lang LIKE '%python%')

  def update
    respond_to do |format|
      if @gist.update(gist_params)
---
UPDATE "gists" SET "lang" = ?, "updated_at" = ? WHERE "gists"."id" = 1  [["lang", "c"], ["updated_at", Sun, 23 Mar 2014 21:15:32 UTC +00:00]]

    def set_gist
      @gist = Gist.find(params[:id])
---
SELECT "gists".* FROM "gists" WHERE "gists"."id" = ? LIMIT 1  [["id", "1"]]